export default {
  '1537613985485': {
    res: [
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          'Hi，这是我做的一个东西。我觉得，可以方便用于不厌其烦地回答不同的客户同样的问题'
      }
    ],
    req: [{ value: '哦？是吗？', next: '1537614108480' }]
  },
  '1537614108480': {
    res: [
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '是的，刚刚你也注意到，客户是无法输入的，这没关系，给多他几个选择就好了。比如……'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value: '你好，这里是威威单车，需要了解些什么？'
      }
    ],
    req: [
      { value: '随便看看', next: '1537614253278' },
      { value: '车架', next: '1537614253278' },
      { value: '润滑油', next: '1537614253278' },
      { value: '油刹', next: '1537614253278' }
    ]
  },
  '1537614253278': {
    res: [
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '诸如此类吧，你可以根据用户不同的选择，指向不同的回答，但为了方便，刚刚那四个选择，无论你选哪个都会指向这里。'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '理论上可以设置无限多个选择，但出于用户体验，四五个也就够了，然后再一层层分流。'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '形式大概就是这样的对话形式，由于这个东西全是我做的，所以，你看见的所有元素都可以更改。那么，你觉得怎么样？'
      }
    ],
    req: [
      { value: '挺好的！', next: '1537614569076' },
      { value: '不怎么样！', next: '1537614569076' }
    ]
  },
  '1537614569076': {
    res: [
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '当然啦，为了演示方便，刚刚那两个选择也同样会指回这里。有两个比较重要的功能还没说……'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '第一个是场景记忆，比如我们现在聊到这里，你突然要退出，去微信收个红包，回来之后没必要再从最开始的那句“Hi……”开始了！'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '它会记住你当前的进度，再进来的时候可以让你从现在我们聊天的这个场景开始，不信你现在退出去到微信给我发个红包。'
      }
    ],
    req: [
      { value: '也好，不用每次都像傻子一样从头开始。', next: '1537614930421' }
    ]
  },
  '1537614930421': {
    res: [
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '嗯，还有一个比较重要的功能是，【场景分享】，你可以试试，看完这句话之后，直接把当前网址分享给老板娘，她再打开，应该就是从我这句话开始看了。'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '你应该明白我什么意思，客人开门见山地问【车架】信息的时候，你可以直接发个带场景的链接给他。他一打开就会显示车架信息。'
      }
    ],
    req: [{ value: '好像，还不错！', next: '1537615252074' }]
  },
  '1537615252074': {
    res: [
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '我也觉得，稍后（这两天）我会继续支持图片和网页链接，你就可以发图和淘宝链接了。'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value:
          '所以，只要编辑好场景，你就存一个场景list就好了。当然，如果这些功能都不能解决客户的疑问，那还是需要人工上的。'
      },
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value: '就这些！'
      }
    ],
    req: [{ value: 'OK，了解了~', next: '1537615428844' }]
  },
  '1537615428844': {
    res: [
      {
        label: '威威',
        mark: '我们的目标是远方的海',
        uid: 'weiwei',
        value: '行了，去忙吧，你再点也是死循环！'
      }
    ],
    req: [{ value: '我不信！', next: '1537615428844' }]
  }
}
